while True:
    print("""เลือกเมนู:
    1.คำนวณเซลเซียสเป็นฟาเรนไฮ
    2.คำนวณฟาเรนไฮเป็นเซลเซียส
    3.ปุ่มออกจากโปรแกรม""")


    num=int(input("กรุณาเลือกหมายเลข: "))
    if num == 1:
        cs=int(input("กรุณาระบุอุณหภูมิในหน่วยเซลเซียส: "))
        print("อุณหภูมิในหน่วยฟาเรนไฮคือ: ",round((cs*9/5)+32,2)," องศา Faherenheit")
    elif num == 2:
        fh=int(input("กรุณาระบุอุณหภูมิในหน่วยฟาเรนไฮ: "))
        print("อุณหภูมิในหน่วยเซลเซียสคือ: ",round((fh-32)*5/9,2)," องศา Celsius")
    else:
        print("ออกจากโปรแกรม")
        break